# 4.5 DATA CONSISTENCY CHECKS
****

**SCRIPT CONTENTS:**

1. Importing Libraries & Files
2. Data Consistency Checks
      - Mixed-Type Data
      - MIssing Values
      - Duplicates
3. Tyding Up DataFrame
4. Exporting Clean DataFrame: **Product Data Clean.csv & Order Data Clean.csv**

** **
#### 1. IMPORTING LIBRARIES & FILES

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Document File Location
path = r'C:\Users\G\12-2022 Instacart Basket Analysis'

In [3]:
# Import Wrangled Orders file
df_ords2 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [4]:
# Import Products file
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

** **
#### 2. DATA CONSISTENCY CHECKS

#### _A) MIXED-TYPE DATA_

In [5]:
# Create a dataframe (Run Test)
df_test = pd.DataFrame()

In [6]:
# Create a Mixed-Type Column
df_test['mix'] =['a', 'b', 1, True]

In [7]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [8]:
# Check for Mixed-Typed Column (Run Test)

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [9]:
# Update Mixed-Typed Column (Run Test)
df_test['mix'] = df_test['mix'].astype('str')

** **
#### _B) MISSING VALUES_

_FINDING MISSING VALUES_

In [10]:
# Finding existing values within Proucts Dataframe (Null Entries)
df_prods.isnull()

       product_id  product_name  aisle_id  department_id  prices
0           False         False     False          False   False
1           False         False     False          False   False
2           False         False     False          False   False
3           False         False     False          False   False
4           False         False     False          False   False
...           ...           ...       ...            ...     ...
49688       False         False     False          False   False
49689       False         False     False          False   False
49690       False         False     False          False   False
49691       False         False     False          False   False
49692       False         False     False          False   False

[49693 rows x 5 columns]

_**NOTE:** **True (1) - has** missing value ; **False (0)** - no missing value;_

In [11]:
# Total Missing Value per Column
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

_**NOTE:** product_name column contains 16 missing values_

In [12]:
# Missing Value Subset
df_nan = df_prods.loc[df_prods['product_name'].isnull()==True]

In [13]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

_**NOTE:** Syntax returned 16 rows of missing value under product_name column._

_ADDRESSING MISSING VALUES_

_For **product_name columns with missing values**, it can't be imputed/manipulated since this is a string data type_

**NOTE:** You can either remove the missing values entirely or filter out the ones that aren’t missing into a subset dataframe and continue your analysis with this new dataframe.

In [14]:
# Verifying Products dataframe dimension
df_prods.shape

(49693, 5)

In [15]:
# Create new products dataframe without missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull()==False]

df_prods_clean.shape

(49677, 5)

** **
#### _C) DUPLICATES_

_FINDING DUPLICATES_

In [16]:
# Search FULL Duplicate
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [17]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

_ADDRESSING DUPLICATES_

In [18]:
# Verify Clean Product Dataframe
df_prods_clean.shape

(49677, 5)

In [19]:
# SUBSET: Clean Products Dataframe with duplicate
df_pords_clean_no_dups = df_prods_clean.drop_duplicates()

df_pords_clean_no_dups.shape

(49672, 5)

** **
#### 3. TIDYING UP DATAFRAME

**Q2. Run the df.describe() function on your df_prods dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.**

_NOTE: Keep an eye on min and max values!_

In [20]:
# Verify Products Dataframe Statistical Description
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

**OBERSERVATION:** All figures shows valid values **except** the _max price value of 99999.000000_ is questionable. Further investigation is needed to understand why this is so.

**Q3. Check for mixed-type data in your df_ords dataframe.**

**Q4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.**

In [21]:
# Searh for Mixed-Type Data in Orders DataFrame

for col in df_ords2.columns.tolist():
  weird = (df_ords2[[col]].applymap(type) != df_ords2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords2[weird]) > 0:
    print (col)

**ANSWER (Q3 - Q4):** No existing mixed-type data in orders dataframe.

**Q5. Run a check for missing values in your df_ords dataframe.**

_In a markdown cell, report your findings and propose an explanation for any missing values you find._

In [22]:
# Check Orders DataFrame Dimension
df_ords2.shape

(3421083, 6)

In [23]:
# Finding existing values within Orders Dataframe (Null Entries)
df_ords2.isnull()

,order_id,customer_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,False,False,False,False,False,True
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
3421078,False,False,False,False,False,False
3421079,False,False,False,False,False,False
3421080,False,False,False,False,False,False
3421081,False,False,False,False,False,False
3421082,False,False,False,False,False,False

In [24]:
# Total Missing Value per Column in Orders
df_ords2.isnull().sum()

order_id                       0
customer_id                    0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [25]:
# Create Order Dataframe Subset with # Missing Value Subset
df_ords2_nan = df_ords2.loc[df_ords2['days_since_prior_order'].isnull()==True]

df_ords2_nan

,order_id,customer_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

**OBERSERVATION:** The **days_since_prior_order** column has _206,209_ missing values which is 6% of dataframe. I am assuming that user_ids with NaN values maybe new clients with no established purchase history. This may be true for all first time buyers in orders record.

**Q6. Address the missing values using an appropriate method.**

_In a markdown cell, explain why you used your method of choice._

In [26]:
# Create a New Customer Subset
df_ords2_nw_cstmr = df_ords2

df_ords2_nw_cstmr['new_customer'] = df_ords2['days_since_prior_order'].isnull() == True

df_ords2_nw_cstmr

,order_id,customer_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

**ANSWER:** Created a subset for **first-time buyers** to distinguish the activities from old to new clients.

**Q7. Run a check for duplicate values in your df_ords data**

_In a markdown cell, report your findings and propose an explanation for any duplicate values you find._

**Q8. Address the duplicates using an appropriate method.**

_In a markdown cell, explain why you used your method of choice._

In [27]:
# Search FULL Duplicate
df_ords2_dups = df_ords2[df_ords2.duplicated()]

df_ords2_dups

Empty DataFrame
Columns: [order_id, customer_id, order_number, order_day_of_week, order_hour_of_day, days_since_prior_order, new_customer]
Index: []

**ANSWER (7 - 8):** No existing duplicates entries in orders dataframe.

** **
#### 4. EXPORTING CLEAN DATA FRAME (ORDERS & PRODUCTS)

In [28]:
# Export Product (Data Consistency) Dataframe
df_pords_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data','Product Data Clean.csv'), index = False)

In [29]:
# Export Orders (Data Consistency) Dataframe
df_ords2.to_csv(os.path.join(path, '02 Data','Prepared Data','Order Data Clean.csv'), index = False)